
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"GameManager.h"
#include	"Image.h"
#include	"ExpUI.h"
#include	<math.h>

//***************************************************************
//
//	ExpUIクラス
//
//***************************************************************

//---------------------------------------------------------------------------------------
//	グローバル	
//---------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------
//	初期化・解放
//---------------------------------------------------------------------------------------

//	コンストラクタ
ExpUI::ExpUI(int x, int y, int w, int h)
{
	//	座標、サイズ情報格納
	size = w / 6;
	posx = x;
	posy = y - h / 2 - size / 6;	//	height / 6 = アイコンサイズの1/6分余白を空ける

	//	EXP文字アイコン
	icon = new Image();
	icon->Initialize("DATA/UI/main_UI/ExpIcon.png", posx, posy, size, size, 0, 0, EXP_MAX::ICON_SIZE, EXP_MAX::ICON_SIZE);

	//	経験値の値
	for (int i = 0; i < EXP_MAX::DIGIT_MAX; i++)
	{
		number[i] = new Image();
		number[i]->Initialize("DATA/UI/main_UI/Number.png", 0, 0, 0, 0, 0, 0, 0, 0);	//	初期化
	}
	exp = 9456;
}

//	デストラクタ
ExpUI::~ExpUI(void)
{
	SafeDelete( icon );
	for (int i = 0; i < EXP_MAX::DIGIT_MAX; i++)
	{
		SafeDelete( number[i] );
	}
}



//---------------------------------------------------------------------------------------
//	更新・描画
//---------------------------------------------------------------------------------------

//	更新
void	ExpUI::Update(void)
{
	ExpManager();
}

void	ExpUI::ExpManager(void)
{

	//	桁数分の入れ物を用意(初期化)
	int numbox[EXP_MAX::DIGIT_MAX];
	int	digit = (int)log10((float)exp) + 1;				//	桁数
	for (int i = 0; i < EXP_MAX::DIGIT_MAX; i++)
	{
		numbox[i] = -1;
	}

	//	もし、最大桁数を超えた値の場合最大桁数の最大数を表示
	if (EXP_MAX::DIGIT_MAX < digit)
	{
		for (int i = 0; i < EXP_MAX::DIGIT_MAX; i++)
		{
			numbox[i] = 9;
		}
		return;
	}

	for (int i = 0; i < digit; i++)
	{
		int n = 10;	//	べき乗計算用
		for (int j = digit - 2; j > i; j--){		//	-2はべき乗計算のために減らしている
			n *= 10;
		}
		numbox[i] = exp / n;
	}

	char str[64];
	for (int i = 0; i < EXP_MAX::DIGIT_MAX; i++){
		sprintf_s(str, "number = %f", numbox[i]);
		IEX_DrawText(str, 20, 100 + 20 * i, 400, 100, 0xFF00FF00);
	}
	
}

//	描画
void	ExpUI::Render(void)
{
	icon->Render(IMAGE_MODE::ADOPTPARAM);

}

//---------------------------------------------------------------------------------------
//	動作関数
//---------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------
//	情報設定
//---------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------
//	情報取得
//---------------------------------------------------------------------------------------

