
#include	"iextreme.h"
#include	"InputManager.h"

//***************************************************************
//
//	InputManagerクラス
//
//***************************************************************

//-------------------------------------------------------------------------------------
//	グローバル
//-------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------
//	初期化・解放
//-------------------------------------------------------------------------------------

	//	コンストラクタ
	InputManager::InputManager( void )
	{
	
	}

	//	デストラクタ
	InputManager::~InputManager( void )
	{

	}

//-------------------------------------------------------------------------------------
//	入力取得
//-------------------------------------------------------------------------------------

	//	左スティック入力取得
	void	InputManager::GetStickInputLeft( float& axisX, float& axisY )
	{
		axisX = KEY( KEY_AXISX ) * 0.001f;
		axisY = -KEY( KEY_AXISY ) * 0.001f;
	}

	//	右スティック入力取得
	void	InputManager::GetStickInputRight( float& axisX, float& axisY )
	{
		//	出力
		axisX = KEY( KEY_AXISX2 ) * 0.001f;
		axisY = -KEY( KEY_AXISY2 ) * 0.001f;
	}
