
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"GameParam.h"
#include	"DrawShape.h"
#include	"NetEnemy.h"

//***************************************************************
//
//	NetEnemyクラス
//
//***************************************************************

//----------------------------------------------------------------------------------------------
//	グローバル
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	初期化・解放
//----------------------------------------------------------------------------------------------

	//	コンストラクタ
	NetEnemy::NetEnemy( void ) : obj( nullptr ),
		pos( 0.0f, 0.0f, 0.0f ), 
		angle( 0.0f ),
		isAlive( false )
	{
	
	}

	//	デストラクタ
	NetEnemy::~NetEnemy( void )
	{
		//SafeDelete( obj );
	}

	//	初期化
	void	NetEnemy::Initialize( iex3DObj* org, const Vector3& Pos, float Angle )
	{
		this->pos = Pos;
		this->angle = Angle;
		obj = org;
		obj->SetPos( pos );
		obj->SetAngle( angle );
		obj->Update();
	}

//----------------------------------------------------------------------------------------------
//	更新・描画
//----------------------------------------------------------------------------------------------

	//	更新
	void	NetEnemy::Update( void )
	{
		obj->SetPos( pos );
		obj->SetAngle( angle );
		obj->Update();
		obj->Animation();
	}

	//	描画
	void	NetEnemy::Render( void )
	{
		obj->Render();
	}

//----------------------------------------------------------------------------------------------
//	動作関数
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	情報設定
//----------------------------------------------------------------------------------------------

	//	座標設定
	void	NetEnemy::SetPos( const Vector3& pos )
	{
		this->pos = pos;
	}

	//	方向設定
	void	NetEnemy::SetAngle( float angle )
	{
		this->angle = angle;
	}

	//	モーション設定
	void	NetEnemy::SetMotion( int motion )
	{
		if ( obj->GetMotion() != motion )
		{
			obj->SetMotion( motion );
		}
	}

	//	メッシュ設定
	void	NetEnemy::SetMesh( iex3DObj*	mesh )
	{
		obj = mesh;
	}

//----------------------------------------------------------------------------------------------
//	情報取得
//----------------------------------------------------------------------------------------------

	//	座標取得
	Vector3	NetEnemy::GetPos( void )const
	{
		return	pos;
	}

