
#include	"iextreme.h"
#include	"system/Scene.h"
#include	"system/Framework.h"
#include	"GlobalFunction.h"
#include	"GameData.h"
#include	"GameManager.h"
#include	"GameParam.h"
#include	"Camera.h"
#include	"sceneMain.h"
#include	"sceneTitle.h"

//***************************************************************
//
//	sceneTitleクラス
//
//***************************************************************

//-----------------------------------------------------------------------------------
//	グローバル
//-----------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------
//	初期化・解放
//-----------------------------------------------------------------------------------

	//	初期化
	bool	sceneTitle::Initialize( void )
	{
		//	カメラ初期化
		mainView = new Camera();

		//	変数初期化
		connectionOK = false;

		return	true;
	}

	//	解放
	sceneTitle::~sceneTitle( void )
	{
		SafeDelete( mainView );
	}

//-----------------------------------------------------------------------------------
//	更新・描画
//-----------------------------------------------------------------------------------

	//	更新
	void	sceneTitle::Update( void )
	{
		if ( !connectionOK )
		{
			if ( KEY( KEY_ENTER ) == 3 )
			{
				MainFrame->ChangeScene( new sceneMain() );
				return;
			}
		}

	}

	//	描画
	void	sceneTitle::Render( void )
	{
		//	camera
		mainView->Activate();
		mainView->Clear();

		if ( connectionOK )
		{
			char	str[256];
			sprintf_s( str, "connectionOK\n" );
			IEX_DrawText( str, 1000, 600, 200, 200, 0xFFFFFF00 );
		}
	}

//-----------------------------------------------------------------------------------
//	動作関数
//-----------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------
//	情報設定
//-----------------------------------------------------------------------------------