
#pragma once

//***************************************************************
//
//	GameDataクラス
//
//***************************************************************

//	include
#include	"iextreme.h"

//-------------------------------------------------------------------------------------
//	定数
//-------------------------------------------------------------------------------------
#define	PLAYER_MAX	4		//	プレイヤー最大数
#define	PORT_NUM	9000	//	ポート番号

//-------------------------------------------------------------------------------------
//	プレイヤーデータ
//-------------------------------------------------------------------------------------

	//	データ情報
	enum DATA_INFO
	{
		COMMAND,
		ID,
		DATA
	};

	//	プレイヤー基本情報
	struct PlayerInfo
	{
		bool	active;
		char	name[17];
	};

	//	プレイヤーパラメータ
	struct PlayerParam
	{
		Vector3	pos;
		float		angle;
	};

//-------------------------------------------------------------------------------------
//	ネット情報
//-------------------------------------------------------------------------------------

	//	コマンド情報
	enum COMMANDS
	{
		NO_COMMAND = -1,
		CHARA_INFO,
		SIGN_UP = 10,
		SIGN_OUT,
	};

	//	キャラ情報
	struct NET_CHARA
	{
		char	com;
		int		id;
		float	angle;
		float x, y, z;
	};

	//	サインアウト
	struct NET_OUT
	{
		char	com;
		int		id;
	};

	//	サインイン
	struct NET_IN
	{
		char	com;
		int		id;
		char	name[17];
	};