
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"GameParam.h"
#include	"AttackItem.h"

//**************************************************************************
//
//	AttackItemクラス
//
//**************************************************************************

//----------------------------------------------------------------------------------------------
//	グローバル
//----------------------------------------------------------------------------------------------

#define	EFFECTIVE_TIME		5.0f
#define	DOUBLE_PARAM		1.5f

//----------------------------------------------------------------------------------------------
//	初期化・解放
//----------------------------------------------------------------------------------------------

	//	コンストラクタ
	AttackItem::AttackItem( int id ) : Item( id )
	{
	
	}

	//	デストラクタ
	AttackItem::~AttackItem( void ) 
	{
		
	}

//----------------------------------------------------------------------------------------------
//	更新
//----------------------------------------------------------------------------------------------

	//	更新
	void	AttackItem::Update( void )
	{
		if ( timer->Update() )
		{
			//	無効中処理
			if ( state )
			{
				//	有効中処理
				gameParam->GetPlayerStatus( id ).power =
					gameParam->GetPlayerStatus( id ).savePower;
				
				//	ステータスを無効
				state = false;

				//	送信
				SendStatusData sendData( SEND_STATUS::ATTACK, gameParam->GetPlayerStatus( id ).power );
				gameParam->send( id, ( LPSTR )&sendData, sizeof( sendData ) );
			}
		}
		else
		{
			//	有効中処理
			gameParam->GetPlayerStatus( id ).power = 
				( int )( gameParam->GetPlayerStatus( id ).savePower * DOUBLE_PARAM );

			//	送信
			SendStatusData sendData( SEND_STATUS::ATTACK, gameParam->GetPlayerStatus( id ).power );
			gameParam->send( id, ( LPSTR )&sendData, sizeof( sendData ) );
		}
	}

//----------------------------------------------------------------------------------------------
//	動作関数
//----------------------------------------------------------------------------------------------

	//	アイテム使用
	void	AttackItem::UseItem( void )
	{
		timer->Start( EFFECTIVE_TIME );
		state = true;
	}

//----------------------------------------------------------------------------------------------
//	
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	グローバル
//----------------------------------------------------------------------------------------------

