
#pragma once

//*****************************************************************************************************************************
//
//	EnemyManagerクラス
//
//*****************************************************************************************************************************

//	include

//	class
class EnemyManager
{
private:
public:
	//	初期化・解放
	EnemyManager( void );
	~EnemyManager( void );
	
	//	更新
	void	Update( void );

	//	動作関数

	//	情報設定
	Vector3	GetPos( void )const;

	//	情報取得

};
