
#pragma once

//***************************************************************
//
//	GameData
//
//***************************************************************

//-------------------------------------------------------------------------------------
//	プレイヤー情報
//-------------------------------------------------------------------------------------

#define	PLAYER_MAX		4

	//	データ構造
	enum
	{
		COMMAND,
		ID, 
		DATA
	};

	//	プレイヤー情報
	struct PlayerInfo
	{
		bool	active;
		char	name[17];
	};

	//	プレイヤーパラメータ
	struct PlayerParam
	{
		Vector3 pos;
		float		angle;
	};

//-------------------------------------------------------------------------------------
//	ネット情報
//-------------------------------------------------------------------------------------

	//	コマンド
	enum COMMANDS
	{
		NO_COMMNAD = -1,
		CHARA_INFO, 
		SIGN_UP = 10,
		SIGN_OUT = 11,
	};

	//	サインイン
	struct NET_IN
	{
		char	com;
		int		id;
		char	name[17];
	};

	//	サインアウト
	struct NET_OUT
	{
		char	com;
		int		id;
	};

	//	キャラクター情報
	struct NET_CHARA
	{
		char com;
		int		id;
		Vector3	pos;
	};
