
#include	"iextreme.h"
#include	<vector>
#include	"GameParam.h"
#include	"MagicManager.h"

//**************************************************************************
//
//	MagicManagerクラス
//
//**************************************************************************

//------------------------------------------------------------------------------------------
//	グローバル
//------------------------------------------------------------------------------------------

MagicManager*	magicManager = nullptr;

//------------------------------------------------------------------------------------------
//	初期化・解放
//------------------------------------------------------------------------------------------

	//	コンストラクタ
	MagicManager::MagicManager( void )
	{
		magicList.clear();
	}

	//	デストラクタ
	MagicManager::~MagicManager( void )
	{
		for ( auto it = magicList.begin(); it != magicList.end(); )
		{
			it = magicList.erase( it );
		}
	}

//------------------------------------------------------------------------------------------
//	更新
//------------------------------------------------------------------------------------------
	
	//	更新
	void	MagicManager::Update( void )
	{
		for ( auto it = magicList.begin(); it != magicList.end(); )
		{
			bool	isAlive = ( *it )->Update();
			int	index = std::distance( magicList.begin(), it );

			if ( !isAlive )	//	消滅しているとき
			{
				it = magicList.erase( it );

				//	消去情報送信
				for ( int p = 0; p < PLAYER_MAX; p++ )
				{
					gameParam->SendMagicEraseInfo( p, index );
				}
				continue;
			}
			else	//	生存しているとき
			{
				//	情報送信
				for ( int p = 0; p < PLAYER_MAX; p++ )
				{
					gameParam->SendMagicInfo( p, index, ( *it )->GetPos() );
				}
			}

			//	次へ
			it++;
		}
	}

//------------------------------------------------------------------------------------------
//	動作関数
//------------------------------------------------------------------------------------------

	//	追加
	void	MagicManager::Append( int id, const Vector3& pos, const Vector3& vec )
	{
		//	初期化
		Magic*	magic = new Magic();
		magic->Initialize( id, pos, vec );

		//	リストに追加
		magicList.push_back( magic );

		//	情報送信
		for ( int p = 0; p < PLAYER_MAX; p++ )
		{
			gameParam->SendMagicAppendInfo( p, id, pos );
		}
	}

//------------------------------------------------------------------------------------------
//	情報設定
//------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------
//	情報取得
//------------------------------------------------------------------------------------------
