
#include	"iextreme.h"
#include	"Timer.h"

//*****************************************************************************************************************************
//
//		ゲームデータ管理
//
//*****************************************************************************************************************************

//----------------------------------------------------------------------------------------------
//	グローバル
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	初期化・解放
//----------------------------------------------------------------------------------------------

	//	コンストラクタ
	Timer::Timer( void ) : remaining( 0.0f ), end( 0.0f )
	{
		
	}

	//	デストラクタ
	Timer::~Timer( void )
	{

	}

//----------------------------------------------------------------------------------------------
//	更新
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	動作関数
//----------------------------------------------------------------------------------------------

	//	タイマースタート
	void	Timer::Start( float limit )
	{
		//	スタート時の時間を格納
		start = std::chrono::system_clock::now();

		end = limit;
	}

	//	制限時間更新( 指定した時間をすぎるとtrueをかえす )
	bool	Timer::Update( void )
	{
		//	現在の時間を取得
		now = std::chrono::system_clock::now();

		//	スタート時の時間との差分を求める
		float difference = 
			( float )std::chrono::duration_cast<std::chrono::milliseconds>( now - start ).count();
		
		//	桁調整にする
		remaining = end - difference / 1000.0f;

		//	指定した時間より差が大きければtrueをかえす
		if ( remaining <= 0.0f )
		{
			remaining = 0.0f;
			return	true;
		}
		return	false;
	}

//----------------------------------------------------------------------------------------------
//	情報設定
//----------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------
//	情報取得
//----------------------------------------------------------------------------------------------

	//	現在の残り時間を取得
	float	Timer::GetRemainingTime( void )const
	{
		return	remaining;
	}

	//	前フレームからの経過時間取得
	float	Timer::GetErapseTime( void )const
	{
		static	auto	lastTime = std::chrono::system_clock::now();

		//	現在の時間を取得
		auto	curTime = std::chrono::system_clock::now();

		//	経過時間を計算
		auto	erapseTime = curTime - lastTime;

		//	経過時間を足す
		lastTime += erapseTime;

		//	経過時間をミリ秒でかえす
		float	out = ( float )std::chrono::duration_cast<std::chrono::milliseconds>( erapseTime ).count();
		out /= 1000.0f;

		//	現在の経過時間を保存
		lastTime = std::chrono::system_clock::now();

		return	out;
	}