
#pragma once

//***************************************************************
//
//	GameData
//
//***************************************************************

//	include
#include	"iextreme.h"

//----------------------------------------------------------------------------
//	定数
//----------------------------------------------------------------------------

#define	PLAYER_MAX	4	//	プレイヤー人数

//----------------------------------------------------------------------------
//	プレイヤー情報
//----------------------------------------------------------------------------

	//	プレイヤー基本情報
	struct PlayerInfo
	{
		bool	active;
		int		type;
		char	name[17];
	};

	//	プレイヤーパラメータ
	struct PlayerParam
	{
		Vector3	pos;
		float		angle;
		int			motion;
	};

	//	チャットパラメータ
	struct ChatParam
	{
		char	msg[50];
		int		count;
	};

//----------------------------------------------------------------------------
//	データ送受信用構造体
//----------------------------------------------------------------------------

	enum RECEIVE_MODE
	{
		MOVE,
		CHAT,
		SIGN_UP = 10,
		SIGN_OUT = 11,
	};

	//	新規参加情報
	struct NET_INFO
	{
		char	com;
		int		id;
		int		type;
		char	name[17];
	};

	//	脱退情報
	struct NET_OUT
	{
		char	com;
		int		id;
	};

	//	チャット情報
	struct NET_CHAT
	{
		char	com;
		int		id;
		char	msg[50];
	};
