
#pragma once

//****************************************************************
//
//	GameData
//
//****************************************************************

//	include
#include	"iextreme.h"

//-------------------------------------------------------------------------------------
//	プレイヤー情報
//-------------------------------------------------------------------------------------

#define	PLAYER_MAX		4

//	プレイヤー基本情報
struct PlayerInfo
{
	bool	active;
	char	name[17];
};

//	プレイヤーパラメータ
struct PlayerParam
{
	Vector3 pos;
	float	angle;
};

//	データ構造
enum 
{
	COMMAND,
	ID,
	DATA,
};

//*****************************************************************************************************************************
//	ネットデータ
//*****************************************************************************************************************************

//	コマンド
enum COMMANDS
{
	NO_COMMAND = -1,
	CHARA_INFO,
	SIGN_UP = 10,
	SIGN_OUT
};

//	新規参加情報
struct NET_IN
{
	char	com;
	int		id;
	char	name[17];
};

//	キャラデータ
struct NET_CHARA
{
	char com;
	int		id;
	Vector3	pos;
};

//	脱退情報
struct NET_OUT
{
	char  com;
	int	  id;
};